Revit 2024 API
AirCoolingCoilType Enumeration
 The type of air cooling coil.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public enum AirCoolingCoilType
Visual Basic
Public Enumeration AirCoolingCoilType
Visual C++
public enum class AirCoolingCoilType
Members
Member name | Description
None
ChilledWater
DirectExpansion
See Also
Autodesk.Revit.DB.Mechanical Namespace